var status = 0;
var selectedType = -1;
var selectedItem = -1;
var item;
var mats;
var matQty;
var cost;
var qty;
var equip;

function start() {
    cm.getPlayer().setCS(true);
    status = -1;
    action(1, 0, 0);
}

function action(mode, type, selection) {
    if (mode == 1) {
        status++;
    } else {
        cm.dispose();
    }
    if (status == 0 && mode == 1) {
        var selStr = "这里是兑换中心，现在开放了一些物品的兑换\r\n您看看有什么感兴趣的？#b"
        var options = ["兑换坐骑", "兑换装备", "兑换正向混沌卷轴", "兑换怪物卡片"];
        for (var i = 0; i < options.length; i++) {
            selStr += "\r\n#L" + i + "# " + options[i] + "#l";
        }

        cm.sendSimple(selStr);
    } else if (status == 1 && mode == 1) {
        selectedType = selection;
        if (selectedType == 0) { 
            var selStr = "一种坐骑佩一种鞍，兑换前请确认坐骑所对应的鞍具#b";
            var items = ["#k用#t1902002#兑换#k#v1902018:##t1902018#", "#k用#t1902018#兑换#k#v1902002:##t1902002#",
                "#k用#t1912000#兑换#k#v1912011:##t1912011#：狼系列坐骑鞍", "#k用#t1912011#兑换#k#v1912000:##t1912000#：冒险家坐骑鞍", "#k兑换坐骑时装#k#v1902024:#", "#k兑换对应的鞍#k#v1912017:#", "#k兑换坐骑时装#k#v1902025:#", "#k兑换对应的鞍#k#v1912018:#",
                "#k兑换坐骑时装#k#v1902026:#", "#k兑换对应的鞍#k#v1912019:#", "#k兑换坐骑时装#k#v1902022:#", "#k兑换对应的鞍#k#v1912015:#", "#k兑换坐骑时装#k#v1902023:#", "#k兑换对应的鞍#k#v1912016:#", "#k兑换坐骑时装#k#v1902014:#", "#k兑换对应的鞍#k#v1912010:#",
                "#k兑换坐骑时装#k#v1902028:#", "#k兑换对应的鞍#k#v1912021:#", "#k兑换坐骑时装#k#v1902029:#", "#k兑换对应的鞍#k#v1912045:#", "#k兑换坐骑时装#k#v1902049:#", "#k兑换对应的鞍#k#v1912042:#", "#k兑换坐骑时装#k#v1902030:#", "#k兑换对应的鞍#k#v1912044:#",
                "#k兑换坐骑时装#k#v1902045:#", "#k兑换对应的鞍#k#v1912038:#", "#k兑换坐骑时装#k#v1902059:#", "#k兑换对应的鞍#k#v1912052:#", "#k兑换坐骑时装#k#v1902057:#", "#k兑换对应的鞍#k#v1912060:#", "#k兑换坐骑时装#k#v1902060:#", "#k兑换对应的鞍#k#v1912053:#",
                "#k兑换坐骑时装#k#v1902055:#", "#k兑换对应的鞍#k#v1912057:#", "#k兑换坐骑时装#k#v1902051:#", "#k兑换对应的鞍#k#v1912051:#", "#k兑换坐骑时装#k#v1902050:#", "#k兑换对应的鞍#k#v1912050:#", "#k兑换坐骑时装#k#v1902054:#", "#k兑换对应的鞍#k#v1912070:#",
                "#k兑换坐骑时装#k#v1902046:#", "#k兑换对应的鞍#k#v1912067:#", "#k兑换坐骑时装#k#v1902052:#", "#k兑换对应的鞍#k#v1912068:#", "#k兑换坐骑时装#k#v1902053:#", "#k兑换对应的鞍#k#v1912069:#", "#k兑换坐骑时装#k#v1902058:#", "#k兑换对应的鞍#k#v1912061:#",
                "#k兑换坐骑时装#k#v1902043:#", "#k兑换对应的鞍#k#v1912073:#", "#k兑换坐骑时装#k#v1902032:#", "#k兑换对应的鞍#k#v1912078:#", "#k兑换坐骑时装#k#v1902027:#", "#k兑换对应的鞍#k#v1912080:#", "#k兑换坐骑时装#k#v1902056:#", "#k兑换对应的鞍#k#v1912071:#",
                "#k兑换坐骑时装#k#v1902037:#", "#k兑换对应的鞍#k#v1912079:#", "#k兑换坐骑时装#k#v1902044:#", "#k兑换对应的鞍#k#v1912072:#", "#k兑换坐骑时装#k#v1902031:#", "#k兑换对应的鞍#k#v1912024:#", "#k兑换坐骑时装#k#v1902048:#", "#k兑换对应的鞍#k#v1912041:#",
                "#k兑换坐骑时装#k#v1902063:#", "#k兑换对应的鞍#k#v1912058:#"];
            for (var i = 0; i < items.length; i++) {
                selStr += "\r\n#L" + i + "# " + items[i] + "#l";
            }
            cm.sendSimple(selStr);
            equip = true;
        } else if (selectedType == 1) { 
            var selStr = "你想兑换哪种物品？#b";
            var crystals = ["#k#v1052081:##t1052081#", "#k#v1002562:##t1002562#", "#k#v1142007:##t1142007#(无幸运属性）", "#k#v1142008:##t1142008#(无幸运属性）"];
            for (var i = 0; i < crystals.length; i++) {
                selStr += "\r\n#L" + i + "# " + crystals[i] + "#l";
            }
            cm.sendSimple(selStr);
            equip = true;
        } else if (selectedType == 2) { 
            var selStr = "你想如何兑换？#b";
            var materials = ["#k#v2049100#30个#t2049100#兑换#v2049122:##t2049122#", "#k#v4001084##t4001084#兑换#v2049122:##t2049122#", "#v1002357##t1002357#兑换#v2049122:##t2049122#", "#v1122000##t1122000#兑换#v2049122:##t2049122#",
                 "#v4000245#20个#t4000245#兑换#v2049122:##t2049122#", "#v4000244#20个#t4000244#兑换#v2049122:##t2049122#", "#v4020009#15个#t4020009#兑换#v2049122:##t2049122#"];
            for (var i = 0; i < materials.length; i++) {
                selStr += "\r\n#L" + i + "# " + materials[i] + "#l";
            }
            cm.sendSimple(selStr);
            equip = false;
        } else if (selectedType == 3) { 
            var selStr = "兑换特定怪物的怪物卡片。#b";
            var materials = ["#k#v4030012#100个#t4030012#兑换#k#v2101049:#盖斯特巴洛召唤包", "#k#v4030012#10个#t4030012#兑换#k#v2100135:#5000万血木桩", "#k999个#v4030012#兑换#v2388046:##t2388046#",
                "#k20个#v4000126#兑换#v2383026:##t2383026#", "#k20个#v4000124#兑换#v2383004:##t2383004#", "#k20个#v4000418#兑换#v2385023:##t2385023#",
                "#k20个#v4000411#兑换#v2384038:##t2384038#",
                "#k20个#v4000419#兑换#v2384040:##t2384040#", "#k20个#v4000336#兑换#v2384010:##t2384010#", "#k20个#v4000415#兑换#v2384037:##t2384037#", "#k20个#v4000416#兑换#v2384039:##t2384039#",
                "#k20个#v4000413#兑换#v2383048:##t2383048#", "#k20个#v4000412#兑换#v2383049:##t2383049#",
                "#k20个#v4000505#兑换#v2388069:##t2388069#", "#k20个#v4000506#兑换#v2388068:##t2388068#", "#k20个#v4000504#兑换#v2388067:##t2388067#", "#k20个#v4001318#兑换#v2388070:##t2388070#",
                "#k20个#v4000460#兑换#v2388040:##t2388040#", "#k20个#v4000461#兑换#v2388041:##t2388041#", "#k20个#v4000462#兑换#v2388042:##t2388042#",
                "#k20个#v4032474#兑换#v2388030:##t2388030#", "#k8个#v4000175#兑换#v2388020:##t2388020#", "#k20个#v2041200#兑换#v2388024:##t2388024#", "#k30个#v4021010#兑换#v2388043:##t2388043#"];
            for (var i = 0; i < materials.length; i++) {
                selStr += "\r\n#L" + i + "# " + materials[i] + "#l";
            }
            cm.sendSimple(selStr);
            equip = false;
        }
        if (equip) {
            status++;
        }
    } else if (status == 2 && mode == 1) {
        selectedItem = selection;
        if (selectedType == 2) { 
            var itemSet = [2049122, 2049122, 2049122, 2049122, 2049122, 2049122, 2049122];
            var matSet = [2049100, 4001084, 1002357, 1122000, 4000245, 4000244, 4020009];
            var matQtySet = [30, 10, 1, 1, 20, 20, 15];
            var costSet = [0, 0, 0, 0, 0, 0];
            item = itemSet[selectedItem];
            mats = matSet[selectedItem];
            matQty = matQtySet[selectedItem];
            cost = costSet[selectedItem];
        }else if (selectedType == 3) { 
            var itemSet = [2101049, 2100135, 2388046, 2383026, 2383004, 2385023, 2384038, 2384040, 2384010, 2384037, 2384039, 2383048, 2383049, 2388069, 2388068, 2388067, 2388070, 2388040, 2388041, 2388042, 2388030, 2388020, 2388024, 2388043];
            var matSet = [4030012, 4030012, 4030012, 4000126, 4000124, 4000418, 4000411, 4000419, 4000336, 4000415, 4000416, 4000413, 4000412, 4000505, 4000506, 4000504, 4001318, 4000460, 4000461, 4000462, 4032474, 4000175, 2041200, 4021010];
            var matQtySet = [100, 10, 999, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 8, 20, 30];
            var costSet = [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0];
            item = itemSet[selectedItem];
            mats = matSet[selectedItem];
            matQty = matQtySet[selectedItem];
            cost = costSet[selectedItem];
        }

        var prompt = "那么，你打算兑换多少#t" + item + "#？#v" + item + ":#\r\n ";

        cm.sendGetNumber(prompt, 1, 1, 100)
    } else if (status == 3 && mode == 1) {
        if (equip) {
            selectedItem = selection;
            qty = 1;
        } else {
            qty = (selection > 0) ? selection : (selection < 0 ? -selection : 1);
        }

        if (selectedType == 0) { 
            var itemSet = [1902018, 1902002, 1912011, 1912011, 
            1902024, 1912017, 1902025, 1912018,
            1902026, 1912019, 1902022, 1912015, 1902023, 1912016, 1902014, 1912010,
            1902028, 1912021, 1902029, 1912045, 1902049, 1912042, 1902030, 1912044 ,
            1902045, 1912038, 1902059, 1912052, 1902057, 1912060, 1902060, 1912053 ,
            1902055, 1912057, 1902051, 1912051, 1902050, 1912050, 1902054, 1912070 ,
            1902046, 1912067, 1902052, 1912068, 1902053, 1912069, 1902058, 1912061 ,
            1902043, 1912073, 1902032, 1912078, 1902027, 1912080, 1902056, 1912071 ,
            1902037, 1912079, 1902044, 1912072, 1902031, 1912024, 1902048, 1912041 ,
            1902063, 1912058];
            var matSet = [1902002, 1902018, 1912000, 1912011,
            4030012, 4030012, 4030012, 4030012,
            4030012, 4030012, 4030012, 4030012, 4030012, 4030012, 4030012, 4030012,
            4030012, 4030012, 4030012, 4030012, 4030012, 4030012, 4030012, 4030012,
            4030012, 4030012, 4030012, 4030012, 4030012, 4030012, 4030012, 4030012,
            4030012, 4030012, 4030012, 4030012, 4030012, 4030012, 4030012, 4030012,
            4030012, 4030012, 4030012, 4030012, 4030012, 4030012, 4030012, 4030012,
            4030012, 4030012, 4030012, 4030012, 4030012, 4030012, 4030012, 4030012,
            4030012, 4030012, 4030012, 4030012, 4030012, 4030012, 4030012, 4030012,
            4030012, 4030012];
            var matQtySet = [1, 1, 1, 1,
            100, 100, 100, 100,
            100, 100, 100, 100, 100, 100, 100, 100,
            100, 100, 100, 100, 100, 100, 100, 100,
            100, 100, 100, 100, 100, 100, 100, 100,
            100, 100, 100, 100, 100, 100, 100, 100,
            100, 100, 100, 100, 100, 100, 100, 100,
            100, 100, 100, 100, 100, 100, 100, 100,
            100, 100, 100, 100, 100, 100, 100, 100,
            100, 100];
            var costSet = [10000000, 10000000, 5000000, 5000000,
            5000000, 5000000, 5000000, 5000000,
            5000000, 5000000, 5000000, 5000000, 5000000, 5000000, 5000000, 5000000,
            5000000, 5000000, 5000000, 5000000, 5000000, 5000000, 5000000, 5000000,
            5000000, 5000000, 5000000, 5000000, 5000000, 5000000, 5000000, 5000000,
            5000000, 5000000, 5000000, 5000000, 5000000, 5000000, 5000000, 5000000,
            5000000, 5000000, 5000000, 5000000, 5000000, 5000000, 5000000, 5000000,
            5000000, 5000000, 5000000, 5000000, 5000000, 5000000, 5000000, 5000000,
            5000000, 5000000, 5000000, 5000000, 5000000, 5000000, 5000000, 5000000,
            5000000, 5000000];
            item = itemSet[selectedItem];
            mats = matSet[selectedItem];
            matQty = matQtySet[selectedItem];
            cost = costSet[selectedItem];
        } else if (selectedType == 1) { 
            var itemSet = [1052081, 1002562, 1142007, 1142008];
            var matSet = [2010009, [2010009, 2010003], 
            [1142165, 2388024, 1122000, 2041200, 1302059, 1312031, 1322052, 1332049, 1332050, 1372032, 1382036, 1402036, 1412026, 1422028, 1432038, 1442045, 1452044, 1462039, 1472051, 1472052, 1482013, 1492013],
            [2388043, 1122012, 1012999,
                1002790, 1002791, 1002792, 1002793, 1002794,
                1052160, 1052161, 1052162, 1052163, 1052164,
                1072361, 1072362, 1072363, 1072364, 1072365,
                1082239, 1082240, 1082241, 1082242, 1082243]];
            var matQtySet = [10, [5, 5],
            [5, 1, 1, 10, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1], 
            [1, 1, 1,
                1, 1, 1, 1, 1,
                1, 1, 1, 1, 1,
                1, 1, 1, 1, 1,
                1, 1, 1, 1, 1,]];
            var costSet = [1000, 1000, 20000000, 50000000];
            item = itemSet[selectedItem];
            mats = matSet[selectedItem];
            matQty = matQtySet[selectedItem];
            cost = costSet[selectedItem];
        }

        var prompt = "是否在此兑换 ";
        if (qty == 1) {
            prompt += "一个 #v" + item + ":##t" + item + "#?";
        } else {
            prompt += qty + " 个#t" + item + "#?";
        }

        prompt += "\r\n兑换需要以下材料。请确保你的背包有足够的空间！#b\r\n";

        if (mats instanceof Array) {
            for (var i = 0; i < mats.length; i++) {
                prompt += "\r\n#v" + mats[i] + ":# " + matQty[i] * qty + " 个#t" + mats[i] + "#";
            }
        } else {
            prompt += "\r\n#v" + mats + ":# " + matQty * qty + " 个#t" + mats + "#";
        }

        if (cost > 0) {
            prompt += "\r\n#i4031138# " + cost * qty + " meso";
        }

        cm.sendYesNo(prompt);
    } else if (status == 4 && mode == 1) {
        var complete = true;
        var recvItem = item, recvQty;

        if (item == 4003000)//screws
        {
            recvQty = 15 * qty;
        } else {
            recvQty = qty;
        }

        if (!cm.canHold(recvItem, recvQty)) {
            cm.sendOk("首先检查你的物品栏是否有空位。");
            cm.dispose();
            return;
        } else if (cm.getMeso() < cost * qty) {
            cm.sendOk("你钱没带够呢，找人借点金币吧！");
            cm.dispose();
            return;
        } else {
            if (mats instanceof Array) {
                for (var i = 0; complete && i < mats.length; i++) {
                    if (!cm.haveItem(mats[i], matQty[i] * qty)) {
                        complete = false;
                    }
                }
            } else if (!cm.haveItem(mats, matQty * qty)) {
                complete = false;
            }
        }

        if (!complete) {
            cm.sendOk("大哥别逗我了，凑够材料再来换吧！");
        } else {
            if (mats instanceof Array) {
                for (var i = 0; i < mats.length; i++) {
                    cm.gainItem(mats[i], -matQty[i] * qty);
                }
            } else {
                cm.gainItem(mats, -matQty * qty);
            }

            if (cost > 0) {
                cm.gainMeso(-cost * qty);
            }
            if (recvItem == 1142007 || recvItem == 1142008) {
                cm.gainItem(recvItem, recvQty);
            }

            else {
                cm.gainItem(recvItem, recvQty, true, true);
            }
            cm.sendOk("兑换成功，欢迎下次光临");
        }
        cm.dispose();
    }
}